Case1_3DCS49_CoarseMesh/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.
// - always: remove zero-sized (non-coupled) patches (that were not added)

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Optional: Write cyclic matches into .obj format; defaults to false.
writeCyclicMatch  true;

// Patches to create.
patches
(
    {
        name cylinder;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (cylinder_0);
    }

    {
        name lateralfront;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (lateralfront_0);
    }

    {
        name lateralback;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (lateralback_0);
    }

    {
        name bottom;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (bottom_0);
    }

    {
        name surface;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (surface_0);
    }

    {
        // Name of new patch
        name inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
            //type cyclic;
            //matchTolerance  0.0001;
            //neighbourPatch outlet;
//            transform       unknown;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (inlet_0);

        // If constructFrom = set : name of faceSet
        set f0;
    }
    {
        // Name of new patch
        name outlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
            //type cyclic;
            //matchTolerance  0.0001;
            //neighbourPatch inlet;
//            transform      unknown;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (outlet_0);

        // If constructFrom = set : name of faceSet
        set f0;
    }
);


// ************************************************************************* //
